tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "heroku/brew"

brew "git"
brew "gcc"
brew "openssl"
brew "openssl@1.1"
brew "pkg-config"
brew "mysql"
brew "sqlite"
brew "angular-cli"
brew "elixir"
brew "node"
brew "npm"
brew "rbenv"
brew "python"
brew "firebase-cli"
brew "heroku"
brew "heroku-node"
brew "mas"
brew "shpotify"
brew "tree"

cask "chromedriver"
cask "iterm2"
cask "dash"
cask "postman"
cask "insomnia"
cask "royal-tsx"
cask "mysqlworkbench"
cask "azure-data-studio"
cask "robo-3t"
cask "pusher"
cask "sourcetree"
cask "sublime-text"
cask "visual-studio-code"
cask "captain"
cask "docker"
cask "charles"
cask "cyberduck"
cask "little-snitch"
cask "dozer"
cask "spectacle"
cask "the-unarchiver"
cask "daisydisk"
cask "google-chrome"
cask "firefox"
cask "firefox-developer-edition"
cask "skype"
cask "slack"
cask "macdown"
cask "microsoft-office"
cask "microsoft-teams"
cask "imageoptim"
cask "adobe-creative-cloud"
cask "sketch"
cask "xmind-zen"
cask "zeplin"
cask "boom-3d"
cask "cave-story"
cask "spotify"
