require("./paths.rb")
printInstallationPath

tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "heroku/brew"

brew "gcc"
brew "openssl"
brew "openssl@1.1"
brew "pkg-config"
brew "angular-cli"
brew "elixir"
brew "python"
brew "node"
brew "npm"
brew "nvm"
brew "rbenv"
brew "httpie"
brew "firebase-cli"
brew "shpotify"
brew "nyancat"
brew "tree"
brew "mas"

cask_args appdir: getPath("/Development Tools") if shouldUseCustomPath? 
cask "chromedriver"
cask "iterm2"
cask "pusher"
cask "postman"
cask "insomnia"
cask "robo-3t"
cask "mysqlworkbench"
cask "sublime-text"
cask "visual-studio-code"
cask "android-studio"

cask_args appdir: getPath("/Virtualization") if shouldUseCustomPath?
cask "captain"
cask "docker"

cask_args appdir: getPath("/Network Management") if shouldUseCustomPath?
cask "charles"
cask "cyberduck"
cask "royal-tsx"

cask_args appdir: getPath("/Utilities") if shouldUseCustomPath?
cask "dozer"
cask "spectacle"
cask "the-unarchiver"
cask "handbrake"
cask "daisydisk"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "whatsapp"
cask "macdown"
cask "typora"
cask "xmind-zen"
cask "microsoft-office"

cask_args appdir: getPath("/Design") if shouldUseCustomPath?
cask "adobe-creative-cloud"
cask "imageoptim"
cask "sketch"
cask "figma"
cask "zeplin"

cask_args appdir: getPath("/Entertainment") if shouldUseCustomPath?
cask "boom-3d"
cask "cave-story"
cask "spotify"
