require("./paths.rb")
printInstallationPath

tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "heroku/brew"

brew "gcc"
brew "openssl"
brew "openssl@1.1"
brew "openjdk"
brew "pkg-config"
brew "angular-cli"
brew "elixir"
brew "python"
brew "node"
brew "npm"
brew "nvm"
brew "rbenv"
brew "httpie"
brew "firebase-cli"
brew "shpotify"
brew "nyancat"
brew "tree"
brew "mas"

cask_args appdir: getPath("/dev_tools") if shouldUseCustomPath? 
cask "dash"
cask "iterm2"
cask "insomnia"
cask "mongodb-compass"
cask "mysqlworkbench"
cask "sublime-text"
cask "visual-studio-code"
cask "android-studio"
cask "flipper"
cask "pusher"
cask "boop"

cask_args appdir: getPath("/virtualization") if shouldUseCustomPath? 
cask "docker"
cask "captain"

cask_args appdir: getPath("/network") if shouldUseCustomPath?
cask "proxyman"
cask "cyberduck"
cask "royal-tsx"

cask_args appdir: getPath("/utilities") if shouldUseCustomPath?
cask "dozer"
cask "spectacle"
cask "the-unarchiver"
cask "google-chrome"
cask "handbrake"
cask "daisydisk"
cask "slack"
cask "notion"
cask "xmind-zen"
cask "whatsapp"
cask "folx"
cask "vlc"

cask_args appdir: getPath("/design") if shouldUseCustomPath?
cask "adobe-creative-cloud"
cask "imageoptim"
cask "figma"
cask "zeplin"

cask_args appdir: getPath("/entertainment") if shouldUseCustomPath?
cask "spotify"
cask "boom-3d"
cask "plex-media-server"
cask "plex"
cask "openemu"
cask "cave-story"
