tap "homebrew/cask"
tap "homebrew/core"
tap "heroku/brew"

brew "git"
brew "openssl"
brew "openssl@1.1"
brew "pkg-config"
brew "mysql"
brew "sqlite"
brew "angular-cli"
brew "elixir"
brew "node"
brew "npm"
brew "python"
brew "firebase-cli"
brew "heroku"
brew "heroku-node"
brew "shpotify"

cask "atom"
cask "azure-data-studio"
cask "chromedriver"
cask "cocoapods"
cask "datagrip"
cask "fastlane"
cask "insomnia"
cask "iterm2"
cask "mysqlworkbench"
cask "postman"
cask "sublime-text"
cask "visual-studio-code"
cask "captain"
cask "docker"
cask "charles"
cask "cyberduck"
cask "little-snitch"
cask "alfred"
cask "google-chrome"
cask "macdown"
cask "macpass"
cask "microsoft-office"
cask "microsoft-teams"
cask "firefox"
cask "onedrive"
cask "skype-for-business"
cask "slack"
cask "the-unarchiver"
cask "espresso"
cask "imageoptim"
cask "sketch"
cask "xmind-zen"
cask "zeplin"
cask "beardedspice"
cask "boom-3d"
cask "cave-story"
cask "spotify"
